data <- c(84,103,70,52,92,76,76,99,72,86,
          112,71,88,100,69,73,89,73,103,89,110,
          105,96,52,62,69,124,116,76,81,42,85,86,
          68,63,66,81,88,90,86,82,58,63,141,79,71,
          101,82,66,93,106,58,84,103,83,46,96,69,58,
          90,55,117,82,97,59,94,112,70,74,49,91,94,106,
          121,59,100,98,104,55,78,78,72,100,95,84,90,106,
          88,106,88,76,88,58,84,87,78,110,85,88,72,95,50,129,
          55,115,102,97,117,104,68,106,63,101,52,103,79,39,91,
          99,91,119,78,65,135,72,92,119,106,80,96,79,103,73,85,
          118,87,86,104,61,87,52,64,84,98,79,94,74,65,78,103,119,
          65,64,99,47,46,110,92,66,102,77,89,86,72,93,90,68,56,73,97,
          111,101,115,135,111,100,50,86,68,114,117,64,73,55,79,102,85,
          96,78,114,99,46,105,74,69,111,93,92,81,94,119,67)

#Розрахунок варіаційного ряд для простої вибірки.
data <- sort(data)
data.intervals <- table(cut(data, 11))
data.freq <- data.intervals/sum(data.intervals)
data.fset <- cbind(data.intervals, data.freq)
df.set <- data.frame(data.fset)
names(df.set)[1] = "N"
names(df.set)[2] = "Частость"
mean(data)
var(data)
#Розрахунок інтервального варіаційного ряду для згрупованої вибірки.

#Розрахунок числових характеристик вибірки.
#DISC



#Гістограма частот.

# гістограма частот
hist(data, 
     cex.lab = 1.5, 
     cex.axis = 1.5,
     breaks = 11,
    main = "Гістограма частот",
    xlab = "Дані",
    ylab = "Щільність",
    col = "red",
    freq = T,
    right = T,
    border = 5,
    axes = F)

axis(1, at = seq(from = 30, to = 150, by = 10))
axis(2, at = seq(from = 0, to = 35, by = 5))

?hist


#відносних частот
hist(data, 
     cex.lab = 1.5, 
     cex.axis = 1.5,
     breaks = 11,
     main = "Гістограма відносних частот",
     xlab = "Дані",
     ylab = "Щільність",
     col = "blue",
     freq = F,
     probability = T,
     right = T,
     border = 5,
     axes = F)

axis(1, at = seq(from = 30, to = 150, by = 10))
axis(2, at = seq(from = 0.000, to = 0.015, by = 0.005))



#нормальний розподіл
curve(dnorm(x, 
            mean = mean(data),
            sd = sd(data)
            ), 
      add = T)

#Емпірична функція розподілу.
library(QRM)

edf(data)
edf(data.freq)
plot(edf(data.freq), type = "l")
stepfun(data)
#ecdf!!!